src/cf/Catalogs/fmBudgetDistributionSteps.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmBudgetDistributionSteps</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.fmBudgetDistributionScenarios</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StepType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetAllocationStepTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetSection</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetFlowOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DepartmentTurnover</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProjectTurnover</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmProjects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionBase</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDistributionBases</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AggregationItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Active</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseAssembleAlgorithm</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistributionBasePeriodicity</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmAvailableReportPeriods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetingScenario</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBudgetingScenarios</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RecipientDepartment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ItemsTurnover</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ItemTurnover</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>BaseAssembleQueryParameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ParameterName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ValueList</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParameterValue</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ProjectsTurnover</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProjectTurnover</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmProjects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/fmBudgetAllocationStepTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmBudgetAllocationStepTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>DistributionBaseAssemble</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DistributionByBasesOnDepartments</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DistributionByBasesOnProjects</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Reclass</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FinResDistribution</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReversalOfPreviousVersionsAllocation</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/fmBudgetDistributionSteps/Ext/ObjectModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

Procedure FillCheckProcessing(Cancel, CheckingAttributes)
	
	If NOT IsFolder Then
		
		If StepType = Enums.fmBudgetAllocationStepTypes.DistributionBaseAssemble Then
			CheckingAttributes.Delete(CheckingAttributes.Find("BudgetSection"));
		ElsIf StepType = Enums.fmBudgetAllocationStepTypes.DistributionByBasesOnDepartments Then
			CheckingAttributes.Delete(CheckingAttributes.Find("DepartmentTurnover"));
		ElsIf StepType = Enums.fmBudgetAllocationStepTypes.Reclass Then
			CheckingAttributes.Delete(CheckingAttributes.Find("DistributionBase"));
			CheckingAttributes.Delete(CheckingAttributes.Find("DepartmentTurnover"));
		ElsIf StepType = Enums.fmBudgetAllocationStepTypes.ReversalOfPreviousVersionsAllocation Then
			CheckingAttributes.Delete(CheckingAttributes.Find("DistributionBase"));
			CheckingAttributes.Delete(CheckingAttributes.Find("DepartmentTurnover"));
			CheckingAttributes.Delete(CheckingAttributes.Find("BudgetSection"));
		EndIf;
		
	EndIf;
EndProcedure

#EndIf
